#include "Engine.h"

/// Тук програмата се стартира
///
/// При началото на програмата се извежда съобщение, което съветва потребителя
/// да използва команда 'help', в случай че той не знае какви други команди се подържат
/// Командата 'help' извежда всички възможни команди, които потребителят може да ползва
/// Те са 'open', 'save', 'saveas', 'close', 'exit', 'print' и 'edit.
/// Командата 'open' приема като параметър име на файл. След извикването на тази команда,
/// подаденият файл се отваря. Създава се таблица с информацията от файла. Тази таблица може да бъде изведена
/// на стандартния изход чрез командата 'print' или може да бъде модифицирана чрез командата 'edit'
/// Командата 'edit' приема като параметър дадена клетка във формат R*C*, където * е някакво число
/// След извикването на командата 'edit', потребителят трябва да въведе информацията, която иска да бъде записана в клетката
/// Тя може да бъде текст, число или формула. Ако е формула, то текста трябва да започне с '='
/// Формулите включват операциите '+', '-', '/', '*' и '^'. Може да се извършват операции с числа, клетки и текст, но текстът се приравнява до числото 0
/// Промените по таблицата могат да бъдат запазени в същия файл чрез командата 'save', могат да бъдат запазени
/// на друго място, чрез командата 'saveas'. За да се отвори друг файл, първо трябва да се затвори текущия чрез команда 'close'
/// За да се излезе от програмата, се изпозлва команда 'exit', но за целта, не трябва да има отворен файл.

int main()
{
    Engine::getInstance().programStart();
}